Repository: Ankshetty/logintoboggan
Catalog: po/*.po
Languages: fr

source: <p>The Login Toboggan module improves the Drupal login system by offering the following features: <ol> <li>Allow users to login using either their username OR their e-mail address.</li> <li>Allow users to define their own password.</li> <li>Allow users to login immediately.</li> <li>Provide a login form on Access Denied pages for non-logged-in (anonymous) users.</li> <li>The module provides two login block options: One uses JavaScript to display the form within the block immediately upon clicking "log in". The other brings the user to a separate page, but returns the user to their original page upon login.</li> <li>Customize the registration form with two e-mail fields to ensure accuracy.</li> </ol> These features may be turned on or off in the Login Toboggan <a href="%url">settings</a>.</p> <p>Feel funny about people logging in at "http://yoursite.com/toboggan/login"? (Yes, we know it's a silly name.) You can use the path.module's "url aliases" to redefine Login Toboggan's paths as something else (perhaps: "usr/login" or just "login").</p> <p>Because this module completely reorients the Drupal login process you will probably want to edit the welcome e-mail on the user settings page. For instance if you have enabled "Set passwords during registration" you probably should not send the user's password out in the welcome e-mail. Also when either "Set passwords during registration" or "Immediate login" are enabled, the %login_url becomes a verification url that the user MUST visit in order to enable authenticated status. The following is an example welcome e-mail:</p>
fr: <p>Le module Login Toboggan améliore considérablement le système d'inscription et d'enregistrement de Drupal avec les améliorations suivantes: <ol> <li>Permets aux usagers du site de se connecter en utilisant leur adresse courriel ET leur nom d'usager, au choix</li> <li>Permets aux nouveaux membres de choisir eux-mêmes leur propre mot de passe</li> <li>Permets aux usagers de se connecter sur le site immédiatement</li> <li>Offre un formulaire d'inscription sur les pages Accès Interdit, pour les usagers anonymes.</li> <li>Ce module propose deux options de connexion: La première utilise JavaScript pour afficher le bloc d'inscription tout de suite après cliqué sur"Identification". Le deuxième amènne l'usager sur une page séparée, mais redirige l'usager vers la bonne page après la connexion.</li> <li>Modifiez le formulaire d'inscription au site en ajoutant deux champs pour le courriel afin de s'assurer que l'adresse courriel est valide.</li> </ol> Toutes ces fonctions peuvent être désactivées dans l'administration de Login Toboggan <a href="%url">paramètres</a>.</p> <p>Vous n'aimez pas que les gens se connectent à l'adresse suivante: "http://yoursite.com/toboggan/login"? (Oui c'est un drôle de nom) Vous pouvez utiliser path.module's "url aliases" pour rediriger Login Toboggan a une nouvelle adresse (peut-être: "usr/connexion" ou seulement "connexion").</p> <p>Étant donné que ce module transforme complètement le système d'enregistrement des membres, vous devriez éditer le courriel de bienvenue sur la page des paramètres des usagers. En effet, si vous avez activé la variable "Choisir le mot de passe pendant l'inscription" vous ne devriez probablement pas envoyer le mot de passe dans le courriel (quoique). Aussi, quand les options "Choisir le mot de passe pendant l'inscription" or "Connexion immédiate" sont activées, l'adresse %login_url devient une page de vérification que les nouveaux membres doivent absolument visiter afin d'obtenir le statut de authenticated user. Voici un exemple de courriel de bienvenue:</p>

source: %username, Thank you for registering at %site. IMPORTANT: For full site access, you will need to click on this link or copy and paste it in your browser: %login_url This will verify your account and log you into the site. In the future you will be able to log in using the username and password that you created during registration. Your new %site membership also enables to you to login to other Drupal powered websites (e.g. http://www.drupal.org/) without registering. Just use the following Drupal ID along with the password you've chosen: Drupal ID: %username@%uri_brief -- %site team
fr: %username, Merci de vous être enregistré sur le site: %site. IMPORTANT: Pour obtenir un accès complet au site, vous devrez cliquer sur ce lien ou copier l'adresse du lien dans votre navigateur web. %login_url De cette façon, nous allons pouvoir confirmer la création de votre compte sur le système et vous donner un accès complet à tous nos services... Vous pourrez des à présent vous connecter au site avec le nom d'usager et le mot de passe que vous avez choisi. Votre nouveau compte sur notre site: %site vous permets aussi de vous connecter sur d'autres sites qui fonctionnent avec Drupal. (voir: http://www.drupal.org/). Utilisez simplement ce nom d'usager: Drupal ID: %username@%uri_brief -- %site team

source: Improves Drupal's login system.
fr: Améliore le système d'enregistrement des usagers de Drupal

source: Customize your login and registration system. More help can be found <a href="%url">here</a>
fr: Vous permets de personnaliser votre système de connexion et d'inscription. Pour obtenir plus d'aide <a href="%url">cliquez ici</a>.</p>

source: Username or e-mail Address
fr: Nom d'usager ou adresse de courriel

source: Enter your %s username. e-mail address, or an ID from one of our affiliates: %a.
fr: Inscrivez votre nom d'usager pour %s. votre adresse de courriel, ou un ID d'un de nos affiliés: %a.

source: Confirm e-mail address
fr: Confirmez votre adresse de courriel

source: Please re-type your e-mail address to confirm it is accurate.
fr: Veuillez s'il vous plaît réecrire l'adresse de courriel afin de la confirmer

source: Password
fr: Mot de passe

source: Please choose a password for your account; it must be between 6 and 30 characters and spaces are not allowed.
fr: Veuillez choisir un mot de passe pour votre compte; celui-ci doit contenir au moins 6 caractères et les espaces ne sont pas permis

source: Confirm Password
fr: Veuillez confirmer votre mot de passe

source: Please re-type your password to confirm it is accurate.
fr: Veuillez retaper votre mot de passe afin de le confirmer

source: Detected malicious attempt to alter protected user fields.
fr: Détection d'une tentative d'alterer des champs protégés

source: New user: %name %email.
fr: Nouveau membre: %name %email

source: edit
fr: éditer

source: drupal user account details for %s
fr: Information des comptes pour: %s

source: <p>Welcome to Drupal. You are user #1, which gives you full and immediate access. All future registrants will receive their passwords via e-mail, so please make sure your website e-mail address is set properly under the general settings on the <a href="%settings">settings page</a>.</p><p> Your password is <strong>%pass</strong>. You may change your password below.</p>
fr: <p>Bienvenue dans Drupal. Vous etes l'utilisateur numéro 1, ce qui vous donne un accès complet et immédiat. Tous les futurs membres de ce site vont recevoir leur mot de passe par courriel, alors assurez vous que votre adresse de courriel est bien configurée dans les paramètres généraux de votre site ici: <a href="%settings">paramètres</a>.</p><p> Votre mot de passe est: <strong>%pass</strong>. Vous pouvez changer votre mot de passe ici bas.</p>"

source: Created a new user account. No e-mail has been sent.
fr: Nouveau compte a été crée. Aucune courriel n'a été envoyé

source: A validation e-mail has been sent to your e-mail address. You will need to follow the instructions in that message in order to gain full access to the site.
fr: Un courriel de validation a été envoyé a votre adresse de messagerie. Vous devez suivre les instrutions dans ce message afin d'obtenir un accès complet au site.

source: Your password and further instructions have been sent to your e-mail address.
fr: Votre mot de passe ainsi que des instructions détaillées ont étés envoyés à votre adresse de courriel

source: %u has applied for an account. %uri
fr: %u demande à obtenir un compte. %uri

source: Thank you for applying for an account. Your account is currently pending approval by the site administrator.<br />In the meantime, your password and further instructions have been sent to your e-mail address.
fr: Merci de nous soumettre une demande d'ouverture de compte. Votre compte est est attente d'approbation pour le moment. <br />Votre mot de passe et certaines instructions supplémentaires viennent de vous être envoyés dans votre compte de messagerie.

source: The username %name has been blocked.
fr: L'usager %name vient d'être bloqué.

source: The name %name is a reserved username.
fr: Le nom %name est réservé.

source: Sorry. Unrecognized username or password.
fr: Désolé, mot de passe ou nom d'usager non reconnu

source: Have you forgotten your password?
fr: Vous avez oublié votre mot de passe?

source: Login attempt failed for %user: %error.
fr: Tentative de connexion ratée pour usager: %user: %error.

source: You may not use an e-mail address as your username.
fr: Vous ne pouvez pas prendre une adresse de courriel comme nom d'usager

source: A password and instructions will be sent to this e-mail address from %sitemail, please check your SPAM filters.
fr: Votre adresse de courriel doit être la même dans le champ de confirmation de l'adresse courriel

source: Your password and confirmed password must match.
fr: Votre mot de passe doit être le même que la confirmation du mot de passe

source: validate e-mail address
fr: Veuillez valider votre adresse de courriel

source: access denied
fr: accès refusé

source: re-send validation e-mail
fr: réenvoyez le email de validation

source: LoginToboggan custom login
fr: connexion personnalisée de LoginToboggan

source: Display the 'logged in' block
fr: Afficher le bloc 'connecté'

source: Block type
fr: Type de bloc

source: Link
fr: Lien

source: Collapsible Form
fr: Menu déroulant

source: Set a custom message to appear at the top of your login block
fr: Insérez un message personnalisé pour mettre sur le haut de votre bloc de connection

source: Login/Register
fr: Connexion/Inscription

source: log out
fr: déconnection

source: Login
fr: Connexion

source: Allow users to login using their e-mail address
fr: Permettre aux usager de ce connecter en utilisant leur adresse de courriel

source: disabled
fr: désactivé

source: enabled
fr: activé

source: Users will be able to enter EITHER their username OR their e-mail address to log in. note: This will disallow users from registering using an e-mail address as their username.
fr: Les usagers vont pouvoir se connecter soit avec leur adresse de courriel ou leur nom d'usager. Veuillez que les usagers ne pourront pas utiliser leur adresse courriel comme nom d'usager

source: Registration
fr: Inscription

source: Use two e-mail fields on registration form
fr: Afficher deux champs de adresse courriel sur le formulaire d'inscription

source: User will have to type the same e-mail address into both fields. This helps to confirm that they've typed the correct address.
fr: L'usager va devoir entrer la même adresse de courriel dans les deux champs, cela va aider à confirmer qu'ils ont tapé la bonne adresse.

source: Allow user to set their password during registration
fr: Permettre aux usagers de choisir leur mot de passe pendant l'inscription au site

source: Disabled
fr: Désactivé

source: Set Password
fr: Activer Mot de passe

source: Set password & Immediate login
fr: Activer mot de passe et connexion immédiate

source: When enabled, users will be assigned to the role below and logged in immediately. They will not be assigned to the "athenticated user" role until they confirm their e-mail address by following the link in their registration e-mail. It is HIGHLY recommended that you set up a "pre-authorized" role with limited permissions for this purpose. <br />NOTE: If you enable either of these features, you should edit the <a href="%settings">user e-mail welcome message</a>--more help in writing the e-mail message can be found in <a href="%help">logintoboggan help</a>.
fr: Ceci va permettre aux usagers de choisir leur mot de passe pendant l'inscription. Si vous avez sélectionné activer mot de passe et connexion immédaite, les usagers vont vont obtenir le rôle suivant et se connecter immédiatement au site. Ils ne vont pas avoir le rôle de Autheticated User jusqu'a ce qu'ils confirment l'adresse de courriel en cliquant sur le lien qui se trouve dans le courriel qu'ils vont recevoir après l'inscription. Il est fortement recommandé de créer un rôle qui a moins de droit que le rôle normal. Si vous activez cette fonction n'oubliez pas de configurer le message d'accueil des nouveaux membres pour refleter ce changement.

source: Non-authenticated role
fr: Rôle non-authentifié

source: If either "Set password during registration" or "Immediate login" is selected, users will be able to login before their e-mail address has been authenticated. Therefore, you must choose a role for new non-authenticated users. Users will be removed from this role and assigned to the "authenticated user" once they follow the link in their welcome e-mail. Add new roles <a href="%url">here</a>.
fr: Si "Choisir le mot de passe pendant l'inscription" ou "Connexion immédiate" est sélectionné, les usagers vont pouvoir se brancher sur le site avant que le adresse de courriel soit authentifiée. C'est pourquoi vous devriez mettre en place un rôle intermédiare avec moins de droit en attendant que les gens confirment leur adresse de courriel. Les usagers pourront accéder au rôle de "authenticated user" une fois qu'ils auront cliqué sur le lien de bienvenue. Ajoutez un nouveau rôle <a href="%url">ici</a>."

source: Other
fr: Autre

source: Present login form on access denied (403)
fr: Presente un formulaire de connexion pour les pages ou l'accès est refusé (403)

source: Anonymous users will be presented with a login form along with an access denied message.
fr: Les utilisateurs anonymes vont voir un formulaire d'inscription quand ils vont tomber sur une page avec accès refusé

source: Access Denied. You may need to log in to access this page.
fr: Accès refusé. Vous avez peut-être besoin de vous connecter au site pour accéder à cette page

source: Access Denied / User Login
fr: Accès refusé / Connexion

source: Access Denied
fr: Accès refusé

source: You are not authorized to access this page.
fr: Vous n'êtes pas autorisé à accéder à cette page

source: You must enter a password.
fr: Vous devez fournir un mot de passe

source: The password cannot contain spaces.
fr: Le mot de passe ne peut pas contenir d'espaces

source: The password contains an illegal character.
fr: Le mot de passe contient un caractère non permis

source: The password is too long: it must be less than 30 characters.
fr: Le mot de passe est trop long, maximum 30 caractères.

source: The password is too short: it must be greater than 6 characters.
fr: Le mot de passe est trop court: minimum 6 lettres

source: E-mail validation URL used for %name with timestamp %timestamp.
fr: URL de validation utilisée pour %name avec la date: %timestamp

source: You have successfully validated your e-mail address.
fr: Vous avez validé votre adresse de courriel avec succès.

source: Session opened for %name.
fr: Ouverture de session pour %name.

source: Account validation
fr: Validation du compte

source: If required, you may reset your password from: %url
fr: Si nécessaire, vous pouvez mettre à jour votre mot de passe ici: %url

source: security
fr: sécurité

source: user
fr: utilisateur
